IwakuraRin/MotaAI-MobileAgent/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3N16R8: 16 MB flash.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# ESP32-S3N16R8: 8 MB Octal SPI PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
